{"1": {"Введение": {"Hello World":  "Напишите программу, которая выводит строчку Hello World! $# Hello World", "Трёхкратное ура!":  "Напишите программу, которая выводит на трёх строчках слово «Ура» $# Ура <br> Ура <br> Ура", "Попугай": "Считайте одну строку и после этого выведите её в консоль. #$ Привет <br> Пока $# Привет <br> Пока"}}, "2": {"Условный оператор":  {"День наоборот":  "В этой задаче всё наоборот! Программа считывает одну строку, в который вы должны ввести либо да, либо нет. Если вы ввели да, то в ответ программа должна вывести нет. Если вы ввели нет, то в ответ программа должна вывести да. #$ Да <br> Нет $# Нет <br> Да", "Покупаю!": "Вы вводите 2 числа (1-е чило цена всех товаров, 2-е число - ваши деньги). Если ваше число больше, чем сумма товаров, то выведите в консоль слово оплачено, иначе выведите не хватает средств. #$ 1000 <br> 500 $# Не хватает средств", "Поиск слов":  "Напишите программу, которая проверяет введеную строчку на наличие следующих слов: наушники, кофе, ягоды, ноутбук. Если в строке есть хотя бы одно из этих слов, то выведите в консоль слово 'Попалось', иначе 'Слова нет! Ищем дальше!' #$ С мая работаю над сайтом. <br> Пью кофе и работаю. <br> Давно не собирал ягоды. $# Слова нет! Ищем Дальше! <br> Попалось <br> Попалось"}}, "3":  {"Встроенные функции питона": {"Больше меньше": "В данной задачке вам придется сравнивать числа. Для начала считайте 2 числа. Потом сравните числаы. Если числа равны, то выведите 'Числа равны', если 1-е число больше 2-ого, то выведите 'Первое больше', а если 2-е число больше 1-ого, то выведите 'Второе больше'. #$ 1 <br> 1 $# Числа равны", "Пароль на замок": "В данной задаче вам необходимо создать программу, которая будет проверять пароль. Сначала вы считываете строку из 3-ёх цифр, затем проверяете её на следующие условия: 1) Цифры не должны повторяться. 2) Пароль должен состоять из 1-ой нечётной и 2-ух чётных цифр. Если цифры повторились, то выведите в консоль следующую фразу: 'Цифры в пароле повторяются!', если же пароль не проходит по 2-ому условию, то выведите в консоль: 'В пароле должна быть 1 нечётная и 2 чётные цифры!', если оба условия прошли, то выведите: 'Пароль установлен!' #$ 123 <br> 223 <br> 241 $# В пароле должна быть 1 нечётная и 2 чётные цифры! <br> Цифры в пароле повторяются! <br> Пароль установлен!", "Профит": "В этой задаче вам необходмо посчитать прибыль крупной компании, а точнеенаписать программу которая будет это делать. Вы считываете 2 числа, где 1-е число это сколько потратила кампания, а второе, сколько она заработала. Затем вам нужно посчитать насколько компания в минусе или плюсе. Если компания заработала больше чем потратила, то вам нужно вывести следующую фразу: 'Компания заработала больше на ... рублей, чем потратила.'. Если же компания не окупила расходы, то выведите фразу: 'Компания заработала меньше на ... рублей, чем потратила.'. Ну а если компания не ушла ни в плюс, ни в минус, то выведите фразу: 'В этом месяце мы потратили и заработали ... рублей.' #$ 500 <br> 1500 $# Компания заработала больше на 1000 рублей, чем потратила."}}}